import React, { useState } from "react";
import { FaArrowDown, FaArrowUp } from "react-icons/fa";

const AboutUs = () => {
  const [showMore, setShowMore] = useState(false);
  return (
    <div className="bg-slate-300">
      <div className="text-center uppercase font-bold italic text-4xl  pb-4">
      हाम्रो बारे
      </div>
      <div className="text-center font-bold text-xl pb-2">
      
हाम्रो बारेमा थप विवरण जान्न, कृपया यस मार्फत जानुहोस् ...
      </div>
      <div className="text-lg pb-10 px-4 lg:px-24 text-justify">
        {showMore
          ? "नेपालको सदुरपुर्वमा रहेको पाँचथर जिल्ला संघीय गणतान्त्रिक संसदिय प्रणालीको नयाँ संरचना अनुसार प्रदेश नं.१ अन्तर्गत पर्दछ । अन्य जिल्ला भन्दा फरक पहिचान बोकेको यस जिल्लाइ एक नगर पालिका र ७ गाँउपालिकामा विभाजन गरिएको छ । एक मात्र फिदिम नगरपालिकामा जिल्लाको सदरमुकाम रहेको छ। यो नगरपालिका समुद्र सतहबाट १३८० फिट फिदिम-४ माझिटार देखि १०७३७ फिट लुङरुपाको छिन्तापुडाँडा उचाइमा अवस्थित छ । पुरानो संरचनाका आठ वटा गाउँ विकास समितिलाइ मिलाएर पुनसंरचना गरिएको यसको क्षेत्रफल १९२.५० वर्ग किलोमिटर रहेको छ। राष्ट्रिय जनगणना २०६८ अनुसार २६०३४ पुरुष र महिला  २३१६७ गरी जम्मा ४९२०१ जनसंख्या रहेको छ । प्रचीन समयमा पल्लो किराँतको नामले चिनिएको याे जिल्ला लिम्बुवान क्षेत्रको केन्द्रका रुममा रहेको थियो । उस जिल्लाको सदरमुकाम फिदिम (फेदेन) मा दश लिम्बुवान क्षेत्रका राजाहरुले संयुत्त सभा गरी सामुहिक रुपले महत्वपुर्ण विषयहरु यहाँ स्थित आम्बेपाजो भन्ने तिर्थ स्थलमा चुम्लुङ द्धारा निर्णय गर्ने परम्परा रहेको देखिन्छ । यस जिल्लाको नामाकरणका बारेमा स्पष्ट आधार नभेटिए पनि जनश्रुतीलाइ नामाकरण आधार मानिदै आएको छ।पान्थरुको अर्थ कुरा थामेको र थुमको अर्थ इलाका/किल्ला भन्ने हुन्छ । यसै शब्दार्थका आधारमा नेपाल एकीकरण पश्चात यहाँका चलिआएका धर्म संस्कृति र रितिरिवाजका बारेमा  फेदेनमा चुम्लुङ बसी गरिएका निर्णय नेपाल सरकारमा पेश हुँदा तत्कालीन राजाले त्यसलाइ स्वीकृति दिएको हुँदा लिम्बुवानको रितिरिवाज सम्बन्धी कुरामिलेको हुँदा यस क्षेत्रको नाम पान्थरु रहेको र पछि प्रयोग गर्दै जाँदा अपभ्रंश भइ पाँचथर भएको पाइन्छ । अर्को तर्फ इस्वी सम्वत ५५० ताका किराँत इतिहासको वर्णन गर्ने क्रममा पान्थरु शब्दको प्रयोग गरेको पाइन्छ । यसरी नै फिदिम भन्ने शब्द लिम्बू भाषाको  फेदेन  शब्दलाइ प्रयाेग गराइको अपभ्रंशबाट रुपान्तरित भइ फिदिम भएको पाइन्छ । "
          : "नेपालको सदुरपुर्वमा रहेको पाँचथर जिल्ला संघीय गणतान्त्रिक संसदिय प्रणालीको नयाँ संरचना अनुसार प्रदेश नं.१ अन्तर्गत पर्दछ । अन्य जिल्ला भन्दा फरक पहिचान बोकेको यस जिल्लाइ एक नगर पालिका र ७ गाँउपालिकामा विभाजन गरिएको छ । एक मात्र फिदिम नगरपालिकामा जिल्लाको सदरमुकाम रहेको छ। यो नगरपालिका समुद्र सतहबाट १३८० फिट फिदिम-४ माझिटार देखि १०७३७ फिट लुङरुपाको छिन्तापुडाँडा उचाइमा अवस्थित छ । पुरानो संरचनाका आठ वटा गाउँ विकास समितिलाइ मिलाएर पुनसंरचना गरिएको यसको क्षेत्रफल १९२.५० वर्ग किलोमिटर रहेको छ। राष्ट्रिय जनगणना २०६८ अनुसार २६०३४ पुरुष र महिला  २३१६७ गरी जम्मा ४९२०१ जनसंख्या रहेको छ ।"}
      </div>
      <div className="flex justify-end pr-24 ">
        <div
          onClick={() => {
            setShowMore(!showMore);
          }}
          className="flex gap-2 bg-[#89bde1fd]  py-3 shadow-lg rounded-md w-32 justify-center hover:bg-blue-300 cursor-pointer "
        >
          <div className="pt-1">
            {showMore ? <FaArrowUp /> : <FaArrowDown />}
          </div>

          <button type="submit" className="text-sm font-extralight ">
            {showMore ? "Show Less  " : "Show More"}
          </button>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
